Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.FrameTypes Enumeration
 The frame types around the dimension values.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum FrameTypes
Public Enumeration FrameTypes
Members
Member name | Value | Description
None | 0 |  No frame.
Rectangle | 1 |  The frame is a rectangle.
Underline | 2 |  The frame is an underline.
RoundedRectangle | 3 |  The frame is a rectangle with rounded ends.
SharpenedRectangle | 8 |  The frame is a rectangle with sharpened ends.
See Also
Reference
Tekla.Structures.Drawing Namespace